/*
 * courier8.cpp
 *
 *  Created on: 04.11.2018
 *		Author: Rudenko Roman (aka Rem Norton)
 *
 */
#include "fonts_lib.h"

uint8_t Courier_New_8pt_Bitmaps[]=
{
/*Bitmap for char ' ' (32)*/
    0x00,				//

/*Bitmap for char '!' (33)*/
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x00,				//
    0x80,				//#

/*Bitmap for char '"' (34)*/
    0xa0,				//# #
    0xa0,				//# #
    0xa0,				//# #

/*Bitmap for char '#' (35)*/
    0x28,				//  # #
    0x50,				// # #
    0xf8,				//#####
    0x50,				// # #
    0x50,				// # #
    0xf8,				//#####
    0x50,				// # #
    0xa0,				//# #

/*Bitmap for char '$' (36)*/
    0x20,				//  #
    0x70,				// ###
    0x80,				//#
    0x60,				// ##
    0x10,				//   #
    0xe0,				//###
    0x40,				// #
    0x40,				// #

/*Bitmap for char '%' (37)*/
    0x40,				// #
    0xa0,				//# #
    0x40,				// #
    0xf0,				//####
    0x20,				//  #
    0x50,				// # #
    0x20,				//  #

/*Bitmap for char '&' (38)*/
    0x30,				//  ##
    0x40,				// #
    0x40,				// #
    0xb0,				//# ##
    0x90,				//#  #
    0x78,				// ####

/*Bitmap for char ''' (39)*/
    0x80,				//#
    0x80,				//#
    0x80,				//#

/*Bitmap for char '(' (40)*/
    0x40,				// #
    0x40,				// #
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x40,				// #
    0x40,				// #

/*Bitmap for char ')' (41)*/
    0x80,				//#
    0x80,				//#
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x80,				//#
    0x80,				//#

/*Bitmap for char '*' (42)*/
    0x20,				//  #
    0xf8,				//#####
    0x20,				//  #
    0x50,				// # #

/*Bitmap for char '+' (43)*/
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0xf8,				//#####
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #

/*Bitmap for char ',' (44)*/
    0x60,				// ##
    0xc0,				//##
    0x80,				//#

/*Bitmap for char '-' (45)*/
    0xf8,				//#####

/*Bitmap for char '.' (46)*/
    0xc0,				//##

/*Bitmap for char '/' (47)*/
    0x08,				//    #
    0x10,				//   #
    0x10,				//   #
    0x20,				//  #
    0x20,				//  #
    0x40,				// #
    0x40,				// #
    0x80,				//#

/*Bitmap for char '0' (48)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char '1' (49)*/
    0x60,				// ##
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0xf8,				//#####

/*Bitmap for char '2' (50)*/
    0x70,				// ###
    0x88,				//#   #
    0x10,				//   #
    0x20,				//  #
    0x40,				// #
    0x80,				//#
    0xf8,				//#####

/*Bitmap for char '3' (51)*/
    0x70,				// ###
    0x88,				//#   #
    0x08,				//    #
    0x30,				//  ##
    0x08,				//    #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char '4' (52)*/
    0x10,				//   #
    0x30,				//  ##
    0x50,				// # #
    0x90,				//#  #
    0xf8,				//#####
    0x10,				//   #
    0x38,				//  ###

/*Bitmap for char '5' (53)*/
    0x78,				// ####
    0x40,				// #
    0x40,				// #
    0x70,				// ###
    0x08,				//    #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char '6' (54)*/
    0x38,				//  ###
    0x40,				// #
    0x80,				//#
    0xf0,				//####
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char '7' (55)*/
    0xf8,				//#####
    0x88,				//#   #
    0x08,				//    #
    0x10,				//   #
    0x10,				//   #
    0x20,				//  #
    0x20,				//  #

/*Bitmap for char '8' (56)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char '9' (57)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x78,				// ####
    0x08,				//    #
    0x10,				//   #
    0xe0,				//###

/*Bitmap for char ':' (58)*/
    0xc0,				//##
    0x00,				//
    0x00,				//
    0x00,				//
    0xc0,				//##

/*Bitmap for char ';' (59)*/
    0x60,				// ##
    0x00,				//
    0x00,				//
    0x60,				// ##
    0xc0,				//##
    0x80,				//#

/*Bitmap for char '<' (60)*/
    0x08,				//    #
    0x30,				//  ##
    0xc0,				//##
    0x30,				//  ##
    0x08,				//    #

/*Bitmap for char '=' (61)*/
    0xf8,				//#####
    0x00,				//
    0xf8,				//#####

/*Bitmap for char '>' (62)*/
    0x80,				//#
    0x60,				// ##
    0x18,				//   ##
    0x60,				// ##
    0x80,				//#

/*Bitmap for char '?' (63)*/
    0x60,				// ##
    0x90,				//#  #
    0x10,				//   #
    0x20,				//  #
    0x20,				//  #
    0x00,				//
    0x60,				// ##

/*Bitmap for char '@' (64)*/
    0x70,				// ###
    0x88,				//#   #
    0x98,				//#  ##
    0xa8,				//# # #
    0xa8,				//# # #
    0x98,				//#  ##
    0x80,				//#
    0x78,				// ####

/*Bitmap for char 'A' (65)*/
    0x30,				//  ##
    0x10,				//   #
    0x28,				//  # #
    0x28,				//  # #
    0x38,				//  ###
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'B' (66)*/
    0xf8,				//#####
    0x44,				// #   #
    0x44,				// #   #
    0x78,				// ####
    0x44,				// #   #
    0x44,				// #   #
    0xf8,				//#####

/*Bitmap for char 'C' (67)*/
    0x78,				// ####
    0x88,				//#   #
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'D' (68)*/
    0xf0,				//####
    0x48,				// #  #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x48,				// #  #
    0xf0,				//####

/*Bitmap for char 'E' (69)*/
    0xf8,				//#####
    0x48,				// #  #
    0x50,				// # #
    0x70,				// ###
    0x50,				// # #
    0x48,				// #  #
    0xf8,				//#####

/*Bitmap for char 'F' (70)*/
    0xf8,				//#####
    0x48,				// #  #
    0x50,				// # #
    0x70,				// ###
    0x50,				// # #
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'G' (71)*/
    0x78,				// ####
    0x88,				//#   #
    0x80,				//#
    0x80,				//#
    0x9c,				//#  ###
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'H' (72)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x7c,				// #####
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'I' (73)*/
    0xf8,				//#####
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0xf8,				//#####

/*Bitmap for char 'J' (74)*/
    0x78,				// ####
    0x10,				//   #
    0x10,				//   #
    0x10,				//   #
    0x90,				//#  #
    0x90,				//#  #
    0x60,				// ##

/*Bitmap for char 'K' (75)*/
    0xee,				//### ###
    0x44,				// #   #
    0x48,				// #  #
    0x70,				// ###
    0x48,				// #  #
    0x44,				// #   #
    0xe6,				//###  ##

/*Bitmap for char 'L' (76)*/
    0xe0,				//###
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x48,				// #  #
    0x48,				// #  #
    0xf8,				//#####

/*Bitmap for char 'M' (77)*/
    0xee,				//### ###
    0x6c,				// ## ##
    0x6c,				// ## ##
    0x54,				// # # #
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'N' (78)*/
    0xee,				//### ###
    0x64,				// ##  #
    0x64,				// ##  #
    0x54,				// # # #
    0x54,				// # # #
    0x4c,				// #  ##
    0xec,				//### ##

/*Bitmap for char 'O' (79)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'P' (80)*/
    0xf0,				//####
    0x48,				// #  #
    0x48,				// #  #
    0x48,				// #  #
    0x70,				// ###
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'Q' (81)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###
    0x38,				//  ###

/*Bitmap for char 'R' (82)*/
    0xf0,				//####
    0x48,				// #  #
    0x48,				// #  #
    0x48,				// #  #
    0x70,				// ###
    0x48,				// #  #
    0xe4,				//###  #

/*Bitmap for char 'S' (83)*/
    0x68,				// ## #
    0x98,				//#  ##
    0x80,				//#
    0x70,				// ###
    0x08,				//    #
    0x88,				//#   #
    0xf0,				//####

/*Bitmap for char 'T' (84)*/
    0xf8,				//#####
    0xa8,				//# # #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x70,				// ###

/*Bitmap for char 'U' (85)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x38,				//  ###

/*Bitmap for char 'V' (86)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x48,				// #  #
    0x28,				//  # #
    0x28,				//  # #
    0x30,				//  ##

/*Bitmap for char 'W' (87)*/
    0xee,				//### ###
    0x44,				// #   #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0x28,				//  # #

/*Bitmap for char 'X' (88)*/
    0xc6,				//##   ##
    0x44,				// #   #
    0x28,				//  # #
    0x10,				//   #
    0x28,				//  # #
    0x44,				// #   #
    0xc6,				//##   ##

/*Bitmap for char 'Y' (89)*/
    0xee,				//### ###
    0x44,				// #   #
    0x28,				//  # #
    0x10,				//   #
    0x10,				//   #
    0x10,				//   #
    0x38,				//  ###

/*Bitmap for char 'Z' (90)*/
    0xf8,				//#####
    0x88,				//#   #
    0x10,				//   #
    0x20,				//  #
    0x40,				// #
    0x88,				//#   #
    0xf8,				//#####

/*Bitmap for char '[' (91)*/
    0xc0,				//##
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0xc0,				//##

/*Bitmap for char '\' (92)*/
    0x80,				//#
    0x40,				// #
    0x40,				// #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x10,				//   #
    0x10,				//   #

/*Bitmap for char ']' (93)*/
    0xc0,				//##
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0xc0,				//##

/*Bitmap for char '^' (94)*/
    0x20,				//  #
    0x50,				// # #
    0x88,				//#   #

/*Bitmap for char '_' (95)*/
    0xfe,				//#######

/*Bitmap for char '`' (96)*/
    0x80,				//#
    0x40,				// #

/*Bitmap for char 'a' (97)*/
    0x70,				// ###
    0x88,				//#   #
    0x78,				// ####
    0x88,				//#   #
    0xfc,				//######

/*Bitmap for char 'b' (98)*/
    0xc0,				//##
    0x40,				// #
    0x58,				// # ##
    0x64,				// ##  #
    0x44,				// #   #
    0x44,				// #   #
    0xf8,				//#####

/*Bitmap for char 'c' (99)*/
    0x78,				// ####
    0x88,				//#   #
    0x80,				//#
    0x80,				//#
    0x78,				// ####

/*Bitmap for char 'd' (100)*/
    0x18,				//   ##
    0x08,				//    #
    0x68,				// ## #
    0x98,				//#  ##
    0x88,				//#   #
    0x88,				//#   #
    0x7c,				// #####

/*Bitmap for char 'e' (101)*/
    0x70,				// ###
    0x88,				//#   #
    0xf8,				//#####
    0x80,				//#
    0x78,				// ####

/*Bitmap for char 'f' (102)*/
    0x30,				//  ##
    0x40,				// #
    0xf0,				//####
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0xf0,				//####

/*Bitmap for char 'g' (103)*/
    0x6c,				// ## ##
    0x98,				//#  ##
    0x88,				//#   #
    0x88,				//#   #
    0x78,				// ####
    0x08,				//    #
    0x70,				// ###

/*Bitmap for char 'h' (104)*/
    0xc0,				//##
    0x40,				// #
    0x58,				// # ##
    0x64,				// ##  #
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'i' (105)*/
    0x20,				//  #
    0x00,				//
    0xe0,				//###
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0xf8,				//#####

/*Bitmap for char 'j' (106)*/
    0x20,				//  #
    0x00,				//
    0xf0,				//####
    0x10,				//   #
    0x10,				//   #
    0x10,				//   #
    0x10,				//   #
    0x10,				//   #
    0xe0,				//###

/*Bitmap for char 'k' (107)*/
    0xc0,				//##
    0x40,				// #
    0x5c,				// # ###
    0x48,				// #  #
    0x70,				// ###
    0x48,				// #  #
    0xdc,				//## ###

/*Bitmap for char 'l' (108)*/
    0x60,				// ##
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0xf8,				//#####

/*Bitmap for char 'm' (109)*/
    0xe8,				//### #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0xfe,				//#######

/*Bitmap for char 'n' (110)*/
    0xd8,				//## ##
    0x64,				// ##  #
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'o' (111)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'p' (112)*/
    0xd8,				//## ##
    0x64,				// ##  #
    0x44,				// #   #
    0x44,				// #   #
    0x78,				// ####
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'q' (113)*/
    0x6c,				// ## ##
    0x98,				//#  ##
    0x88,				//#   #
    0x88,				//#   #
    0x78,				// ####
    0x08,				//    #
    0x1c,				//   ###

/*Bitmap for char 'r' (114)*/
    0xd8,				//## ##
    0x60,				// ##
    0x40,				// #
    0x40,				// #
    0xf0,				//####

/*Bitmap for char 's' (115)*/
    0x78,				// ####
    0x80,				//#
    0x70,				// ###
    0x08,				//    #
    0xf0,				//####

/*Bitmap for char 't' (116)*/
    0x40,				// #
    0xf8,				//#####
    0x40,				// #
    0x40,				// #
    0x44,				// #   #
    0x38,				//  ###

/*Bitmap for char 'u' (117)*/
    0xcc,				//##  ##
    0x44,				// #   #
    0x44,				// #   #
    0x4c,				// #  ##
    0x36,				//  ## ##

/*Bitmap for char 'v' (118)*/
    0xee,				//### ###
    0x44,				// #   #
    0x48,				// #  #
    0x28,				//  # #
    0x30,				//  ##

/*Bitmap for char 'w' (119)*/
    0xee,				//### ###
    0x44,				// #   #
    0x54,				// # # #
    0x54,				// # # #
    0x28,				//  # #

/*Bitmap for char 'x' (120)*/
    0xd8,				//## ##
    0x50,				// # #
    0x20,				//  #
    0x50,				// # #
    0xd8,				//## ##

/*Bitmap for char 'y' (121)*/
    0xee,				//### ###
    0x44,				// #   #
    0x28,				//  # #
    0x28,				//  # #
    0x10,				//   #
    0x10,				//   #
    0x70,				// ###

/*Bitmap for char 'z' (122)*/
    0xf8,				//#####
    0x90,				//#  #
    0x20,				//  #
    0x48,				// #  #
    0xf8,				//#####

/*Bitmap for char '{' (123)*/
    0x20,				//  #
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0xc0,				//##
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x20,				//  #

/*Bitmap for char '|' (124)*/
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x80,				//#

/*Bitmap for char '}' (125)*/
    0x80,				//#
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x60,				// ##
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0x80,				//#

/*Bitmap for char '~' (126)*/
    0x68,				// ## #
    0xb0,				//# ##

/*Bitmap for char 'РЃ' (168)*/
    0x50,				// # #
    0x00,				//
    0xf8,				//#####
    0x48,				// #  #
    0x50,				// # #
    0x70,				// ###
    0x50,				// # #
    0x48,				// #  #
    0xf8,				//#####

/*Bitmap for char 'С‘' (184)*/
    0x50,				// # #
    0x00,				//
    0x70,				// ###
    0x88,				//#   #
    0xf8,				//#####
    0x80,				//#
    0x78,				// ####

/*Bitmap for char 'в„–' (185)*/
    0xdc,				//## ###
    0x6a,				// ## # #
    0x6a,				// ## # #
    0x5a,				// # ## #
    0x58,				// # ##
    0x5a,				// # ## #
    0xe8,				//### #

/*Bitmap for char 'Рђ' (192)*/
    0x30,				//  ##
    0x10,				//   #
    0x28,				//  # #
    0x28,				//  # #
    0x38,				//  ###
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'Р‘' (193)*/
    0xfc,				//######
    0x44,				// #   #
    0x40,				// #
    0x78,				// ####
    0x44,				// #   #
    0x44,				// #   #
    0xf8,				//#####

/*Bitmap for char 'Р’' (194)*/
    0xf8,				//#####
    0x44,				// #   #
    0x44,				// #   #
    0x78,				// ####
    0x44,				// #   #
    0x44,				// #   #
    0xf8,				//#####

/*Bitmap for char 'Р“' (195)*/
    0xf8,				//#####
    0x48,				// #  #
    0x48,				// #  #
    0x40,				// #
    0x40,				// #
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'Р”' (196)*/
    0x7c,				// #####
    0x28,				//  # #
    0x28,				//  # #
    0x28,				//  # #
    0x28,				//  # #
    0x48,				// #  #
    0xfc,				//######
    0x84,				//#    #
    0x84,				//#    #

/*Bitmap for char 'Р•' (197)*/
    0xf8,				//#####
    0x48,				// #  #
    0x50,				// # #
    0x70,				// ###
    0x50,				// # #
    0x48,				// #  #
    0xf8,				//#####

/*Bitmap for char 'Р–' (198)*/
    0xd6,				//## # ##
    0x54,				// # # #
    0x38,				//  ###
    0x10,				//   #
    0x38,				//  ###
    0x54,				// # # #
    0xd6,				//## # ##

/*Bitmap for char 'Р—' (199)*/
    0xb0,				//# ##
    0xc8,				//##  #
    0x08,				//    #
    0x70,				// ###
    0x08,				//    #
    0x08,				//    #
    0xf0,				//####

/*Bitmap for char 'Р�' (200)*/
    0xe6,				//###  ##
    0x4c,				// #  ##
    0x54,				// # # #
    0x54,				// # # #
    0x64,				// ##  #
    0x64,				// ##  #
    0xce,				//##  ###

/*Bitmap for char 'Р™' (201)*/
    0x28,				//  # #
    0x38,				//  ###
    0x00,				//
    0xe6,				//###  ##
    0x4c,				// #  ##
    0x54,				// # # #
    0x54,				// # # #
    0x64,				// ##  #
    0x64,				// ##  #
    0xce,				//##  ###

/*Bitmap for char 'Рљ' (202)*/
    0xec,				//### ##
    0x48,				// #  #
    0x50,				// # #
    0x60,				// ##
    0x50,				// # #
    0x48,				// #  #
    0xec,				//### ##

/*Bitmap for char 'Р›' (203)*/
    0x7e,				// ######
    0x24,				//  #  #
    0x24,				//  #  #
    0x24,				//  #  #
    0x24,				//  #  #
    0x24,				//  #  #
    0xce,				//##  ###

/*Bitmap for char 'Рњ' (204)*/
    0xee,				//### ###
    0x6c,				// ## ##
    0x6c,				// ## ##
    0x54,				// # # #
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'Рќ' (205)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x7c,				// #####
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'Рћ' (206)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'Рџ' (207)*/
    0xfe,				//#######
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'Р ' (208)*/
    0xf0,				//####
    0x48,				// #  #
    0x48,				// #  #
    0x48,				// #  #
    0x70,				// ###
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'РЎ' (209)*/
    0x78,				// ####
    0x88,				//#   #
    0x80,				//#
    0x80,				//#
    0x80,				//#
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'Рў' (210)*/
    0xf8,				//#####
    0xa8,				//# # #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x20,				//  #
    0x70,				// ###

/*Bitmap for char 'РЈ' (211)*/
    0xee,				//### ###
    0x44,				// #   #
    0x28,				//  # #
    0x28,				//  # #
    0x10,				//   #
    0x20,				//  #
    0x60,				// ##

/*Bitmap for char 'Р¤' (212)*/
    0x70,				// ###
    0x20,				//  #
    0xf8,				//#####
    0xa8,				//# # #
    0xf8,				//#####
    0x20,				//  #
    0x70,				// ###

/*Bitmap for char 'РҐ' (213)*/
    0xc6,				//##   ##
    0x44,				// #   #
    0x28,				//  # #
    0x10,				//   #
    0x28,				//  # #
    0x44,				// #   #
    0xc6,				//##   ##

/*Bitmap for char 'Р¦' (214)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0xfe,				//#######
    0x02,				//      #
    0x02,				//      #

/*Bitmap for char 'Р§' (215)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x4c,				// #  ##
    0x34,				//  ## #
    0x04,				//     #
    0x0e,				//    ###

/*Bitmap for char 'РЁ' (216)*/
    0xd6,				//## # ##
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0xfe,				//#######

/*Bitmap for char 'Р©' (217)*/
    0xd6,				//## # ##
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0xfe,				//#######
    0x02,				//      #
    0x02,				//      #

/*Bitmap for char 'РЄ' (218)*/
    0xf0,				//####
    0xa0,				//# #
    0xa0,				//# #
    0x3c,				//  ####
    0x22,				//  #   #
    0x22,				//  #   #
    0x7c,				// #####

/*Bitmap for char 'Р«' (219)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x64,				// ##  #
    0x54,				// # # #
    0x54,				// # # #
    0xee,				//### ###

/*Bitmap for char 'Р¬' (220)*/
    0xe0,				//###
    0x40,				// #
    0x40,				// #
    0x78,				// ####
    0x44,				// #   #
    0x44,				// #   #
    0xf8,				//#####

/*Bitmap for char 'Р­' (221)*/
    0xf0,				//####
    0x88,				//#   #
    0x08,				//    #
    0x78,				// ####
    0x08,				//    #
    0x08,				//    #
    0xf0,				//####

/*Bitmap for char 'Р®' (222)*/
    0xec,				//### ##
    0x52,				// # #  #
    0x52,				// # #  #
    0x72,				// ###  #
    0x52,				// # #  #
    0x52,				// # #  #
    0xec,				//### ##

/*Bitmap for char 'РЇ' (223)*/
    0x3c,				//  ####
    0x48,				// #  #
    0x48,				// #  #
    0x48,				// #  #
    0x38,				//  ###
    0x48,				// #  #
    0x9c,				//#  ###

/*Bitmap for char 'Р°' (224)*/
    0x70,				// ###
    0x88,				//#   #
    0x78,				// ####
    0x88,				//#   #
    0xfc,				//######

/*Bitmap for char 'Р±' (225)*/
    0x10,				//   #
    0xf0,				//####
    0x80,				//#
    0xb0,				//# ##
    0xc8,				//##  #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'РІ' (226)*/
    0xf0,				//####
    0x48,				// #  #
    0x70,				// ###
    0x48,				// #  #
    0xf0,				//####

/*Bitmap for char 'Рі' (227)*/
    0xf8,				//#####
    0x48,				// #  #
    0x48,				// #  #
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'Рґ' (228)*/
    0x7c,				// #####
    0x28,				//  # #
    0x28,				//  # #
    0x28,				//  # #
    0xfc,				//######
    0x84,				//#    #

/*Bitmap for char 'Рµ' (229)*/
    0x70,				// ###
    0x88,				//#   #
    0xf8,				//#####
    0x80,				//#
    0x78,				// ####

/*Bitmap for char 'Р¶' (230)*/
    0xd6,				//## # ##
    0x54,				// # # #
    0x38,				//  ###
    0x54,				// # # #
    0xd6,				//## # ##

/*Bitmap for char 'Р·' (231)*/
    0xf8,				//#####
    0x08,				//    #
    0x70,				// ###
    0x08,				//    #
    0xf8,				//#####

/*Bitmap for char 'Рё' (232)*/
    0xe6,				//###  ##
    0x4c,				// #  ##
    0x54,				// # # #
    0x64,				// ##  #
    0xce,				//##  ###

/*Bitmap for char 'Р№' (233)*/
    0x28,				//  # #
    0x38,				//  ###
    0x00,				//
    0xe6,				//###  ##
    0x4c,				// #  ##
    0x54,				// # # #
    0x64,				// ##  #
    0xce,				//##  ###

/*Bitmap for char 'Рє' (234)*/
    0xec,				//### ##
    0x54,				// # # #
    0x70,				// ###
    0x48,				// #  #
    0xec,				//### ##

/*Bitmap for char 'Р»' (235)*/
    0x7e,				// ######
    0x24,				//  #  #
    0x24,				//  #  #
    0x24,				//  #  #
    0xce,				//##  ###

/*Bitmap for char 'Рј' (236)*/
    0xc6,				//##   ##
    0x6c,				// ## ##
    0x54,				// # # #
    0x54,				// # # #
    0xee,				//### ###

/*Bitmap for char 'РЅ' (237)*/
    0xee,				//### ###
    0x44,				// #   #
    0x7c,				// #####
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'Рѕ' (238)*/
    0x70,				// ###
    0x88,				//#   #
    0x88,				//#   #
    0x88,				//#   #
    0x70,				// ###

/*Bitmap for char 'Рї' (239)*/
    0xfe,				//#######
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0xee,				//### ###

/*Bitmap for char 'СЂ' (240)*/
    0xd8,				//## ##
    0x64,				// ##  #
    0x44,				// #   #
    0x44,				// #   #
    0x78,				// ####
    0x40,				// #
    0xe0,				//###

/*Bitmap for char 'СЃ' (241)*/
    0x78,				// ####
    0x88,				//#   #
    0x80,				//#
    0x80,				//#
    0x78,				// ####

/*Bitmap for char 'С‚' (242)*/
    0xf8,				//#####
    0xa8,				//# # #
    0xa8,				//# # #
    0x20,				//  #
    0x70,				// ###

/*Bitmap for char 'Сѓ' (243)*/
    0xd8,				//## ##
    0x88,				//#   #
    0x50,				// # #
    0x50,				// # #
    0x20,				//  #
    0xa0,				//# #
    0xc0,				//##

/*Bitmap for char 'С„' (244)*/
    0x60,				// ##
    0x20,				//  #
    0x70,				// ###
    0xa8,				//# # #
    0xa8,				//# # #
    0xa8,				//# # #
    0x70,				// ###
    0x20,				//  #
    0x70,				// ###

/*Bitmap for char 'С…' (245)*/
    0xd8,				//## ##
    0x50,				// # #
    0x20,				//  #
    0x50,				// # #
    0xd8,				//## ##

/*Bitmap for char 'С†' (246)*/
    0xee,				//### ###
    0x44,				// #   #
    0x44,				// #   #
    0x44,				// #   #
    0xfe,				//#######
    0x02,				//      #

/*Bitmap for char 'С‡' (247)*/
    0xec,				//### ##
    0x48,				// #  #
    0x78,				// ####
    0x08,				//    #
    0x1c,				//   ###

/*Bitmap for char 'С€' (248)*/
    0xd6,				//## # ##
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0xfe,				//#######

/*Bitmap for char 'С‰' (249)*/
    0xd6,				//## # ##
    0x54,				// # # #
    0x54,				// # # #
    0x54,				// # # #
    0xfe,				//#######
    0x02,				//      #

/*Bitmap for char 'СЉ' (250)*/
    0xf0,				//####
    0xa0,				//# #
    0x3c,				//  ####
    0x24,				//  #  #
    0x7c,				// #####

/*Bitmap for char 'С‹' (251)*/
    0xee,				//### ###
    0x44,				// #   #
    0x74,				// ### #
    0x54,				// # # #
    0xfe,				//#######

/*Bitmap for char 'СЊ' (252)*/
    0xe0,				//###
    0x40,				// #
    0x78,				// ####
    0x48,				// #  #
    0xf8,				//#####

/*Bitmap for char 'СЌ' (253)*/
    0xf0,				//####
    0x88,				//#   #
    0x38,				//  ###
    0x08,				//    #
    0xf0,				//####

/*Bitmap for char 'СЋ' (254)*/
    0xec,				//### ##
    0x52,				// # #  #
    0x72,				// ###  #
    0x52,				// # #  #
    0xec,				//### ##

/*Bitmap for char 'СЏ' (255)*/
    0x7c,				// #####
    0x48,				// #  #
    0x78,				// ####
    0x48,				// #  #
    0xdc,				//## ###

}; //Local 8-bit codepage bitmaps

Font_Char_info_t Courier_New_8pt_Descriptors[]=
{
    {0, 1, 1, 13},	//Descriptor for ' ' (32)
    {1, 1, 7, 3},	//Descriptor for '!' (33)
    {8, 3, 3, 7},	//Descriptor for '"' (34)
    {11, 5, 8, 2},	//Descriptor for '#' (35)
    {19, 4, 8, 2},	//Descriptor for '$' (36)
    {27, 4, 7, 3},	//Descriptor for '%' (37)
    {34, 5, 6, 3},	//Descriptor for '&' (38)
    {40, 1, 3, 7},	//Descriptor for ''' (39)
    {43, 2, 8, 2},	//Descriptor for '(' (40)
    {51, 2, 8, 2},	//Descriptor for ')' (41)
    {59, 5, 4, 6},	//Descriptor for '*' (42)
    {63, 5, 7, 3},	//Descriptor for '+' (43)
    {70, 3, 3, 1},	//Descriptor for ',' (44)
    {73, 5, 1, 6},	//Descriptor for '-' (45)
    {74, 2, 1, 3},	//Descriptor for '.' (46)
    {75, 5, 8, 2},	//Descriptor for '/' (47)
    {83, 5, 7, 3},	//Descriptor for '0' (48)
    {90, 5, 7, 3},	//Descriptor for '1' (49)
    {97, 5, 7, 3},	//Descriptor for '2' (50)
    {104, 5, 7, 3},	//Descriptor for '3' (51)
    {111, 5, 7, 3},	//Descriptor for '4' (52)
    {118, 5, 7, 3},	//Descriptor for '5' (53)
    {125, 5, 7, 3},	//Descriptor for '6' (54)
    {132, 5, 7, 3},	//Descriptor for '7' (55)
    {139, 5, 7, 3},	//Descriptor for '8' (56)
    {146, 5, 7, 3},	//Descriptor for '9' (57)
    {153, 2, 5, 3},	//Descriptor for ':' (58)
    {158, 3, 6, 2},	//Descriptor for ';' (59)
    {164, 5, 5, 4},	//Descriptor for '<' (60)
    {169, 5, 3, 5},	//Descriptor for '=' (61)
    {172, 5, 5, 4},	//Descriptor for '>' (62)
    {177, 4, 7, 3},	//Descriptor for '?' (63)
    {184, 5, 8, 2},	//Descriptor for '@' (64)
    {192, 7, 7, 3},	//Descriptor for 'A' (65)
    {199, 6, 7, 3},	//Descriptor for 'B' (66)
    {206, 5, 7, 3},	//Descriptor for 'C' (67)
    {213, 6, 7, 3},	//Descriptor for 'D' (68)
    {220, 5, 7, 3},	//Descriptor for 'E' (69)
    {227, 5, 7, 3},	//Descriptor for 'F' (70)
    {234, 6, 7, 3},	//Descriptor for 'G' (71)
    {241, 7, 7, 3},	//Descriptor for 'H' (72)
    {248, 5, 7, 3},	//Descriptor for 'I' (73)
    {255, 5, 7, 3},	//Descriptor for 'J' (74)
    {262, 7, 7, 3},	//Descriptor for 'K' (75)
    {269, 5, 7, 3},	//Descriptor for 'L' (76)
    {276, 7, 7, 3},	//Descriptor for 'M' (77)
    {283, 7, 7, 3},	//Descriptor for 'N' (78)
    {290, 5, 7, 3},	//Descriptor for 'O' (79)
    {297, 5, 7, 3},	//Descriptor for 'P' (80)
    {304, 5, 8, 2},	//Descriptor for 'Q' (81)
    {312, 6, 7, 3},	//Descriptor for 'R' (82)
    {319, 5, 7, 3},	//Descriptor for 'S' (83)
    {326, 5, 7, 3},	//Descriptor for 'T' (84)
    {333, 7, 7, 3},	//Descriptor for 'U' (85)
    {340, 7, 7, 3},	//Descriptor for 'V' (86)
    {347, 7, 7, 3},	//Descriptor for 'W' (87)
    {354, 7, 7, 3},	//Descriptor for 'X' (88)
    {361, 7, 7, 3},	//Descriptor for 'Y' (89)
    {368, 5, 7, 3},	//Descriptor for 'Z' (90)
    {375, 2, 8, 2},	//Descriptor for '[' (91)
    {383, 4, 8, 2},	//Descriptor for '\' (92)
    {391, 2, 8, 2},	//Descriptor for ']' (93)
    {399, 5, 3, 7},	//Descriptor for '^' (94)
    {402, 7, 1, 0},	//Descriptor for '_' (95)
    {403, 2, 2, 8},	//Descriptor for '`' (96)
    {405, 6, 5, 3},	//Descriptor for 'a' (97)
    {410, 6, 7, 3},	//Descriptor for 'b' (98)
    {417, 5, 5, 3},	//Descriptor for 'c' (99)
    {422, 6, 7, 3},	//Descriptor for 'd' (100)
    {429, 5, 5, 3},	//Descriptor for 'e' (101)
    {434, 4, 7, 3},	//Descriptor for 'f' (102)
    {441, 6, 7, 1},	//Descriptor for 'g' (103)
    {448, 7, 7, 3},	//Descriptor for 'h' (104)
    {455, 5, 7, 3},	//Descriptor for 'i' (105)
    {462, 4, 9, 1},	//Descriptor for 'j' (106)
    {471, 6, 7, 3},	//Descriptor for 'k' (107)
    {478, 5, 7, 3},	//Descriptor for 'l' (108)
    {485, 7, 5, 3},	//Descriptor for 'm' (109)
    {490, 7, 5, 3},	//Descriptor for 'n' (110)
    {495, 5, 5, 3},	//Descriptor for 'o' (111)
    {500, 6, 7, 1},	//Descriptor for 'p' (112)
    {507, 6, 7, 1},	//Descriptor for 'q' (113)
    {514, 5, 5, 3},	//Descriptor for 'r' (114)
    {519, 5, 5, 3},	//Descriptor for 's' (115)
    {524, 6, 6, 3},	//Descriptor for 't' (116)
    {530, 7, 5, 3},	//Descriptor for 'u' (117)
    {535, 7, 5, 3},	//Descriptor for 'v' (118)
    {540, 7, 5, 3},	//Descriptor for 'w' (119)
    {545, 5, 5, 3},	//Descriptor for 'x' (120)
    {550, 7, 7, 1},	//Descriptor for 'y' (121)
    {557, 5, 5, 3},	//Descriptor for 'z' (122)
    {562, 3, 9, 1},	//Descriptor for '{' (123)
    {571, 1, 8, 2},	//Descriptor for '|' (124)
    {579, 3, 9, 1},	//Descriptor for '}' (125)
    {588, 5, 2, 5},	//Descriptor for '~' (126)
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {590, 5, 9, 3},	//Descriptor for 'РЃ' (168)
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {599, 5, 7, 3},	//Descriptor for 'С‘' (184)
    {606, 7, 7, 3},	//Descriptor for 'в„–' (185)
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {0, 0, 0, 0},
    {613, 7, 7, 3},	//Descriptor for 'Рђ' (192)
    {620, 6, 7, 3},	//Descriptor for 'Р‘' (193)
    {627, 6, 7, 3},	//Descriptor for 'Р’' (194)
    {634, 5, 7, 3},	//Descriptor for 'Р“' (195)
    {641, 6, 9, 1},	//Descriptor for 'Р”' (196)
    {650, 5, 7, 3},	//Descriptor for 'Р•' (197)
    {657, 7, 7, 3},	//Descriptor for 'Р–' (198)
    {664, 5, 7, 3},	//Descriptor for 'Р—' (199)
    {671, 7, 7, 3},	//Descriptor for 'Р�' (200)
    {678, 7, 10, 3},	//Descriptor for 'Р™' (201)
    {688, 6, 7, 3},	//Descriptor for 'Рљ' (202)
    {695, 7, 7, 3},	//Descriptor for 'Р›' (203)
    {702, 7, 7, 3},	//Descriptor for 'Рњ' (204)
    {709, 7, 7, 3},	//Descriptor for 'Рќ' (205)
    {716, 5, 7, 3},	//Descriptor for 'Рћ' (206)
    {723, 7, 7, 3},	//Descriptor for 'Рџ' (207)
    {730, 5, 7, 3},	//Descriptor for 'Р ' (208)
    {737, 5, 7, 3},	//Descriptor for 'РЎ' (209)
    {744, 5, 7, 3},	//Descriptor for 'Рў' (210)
    {751, 7, 7, 3},	//Descriptor for 'РЈ' (211)
    {758, 5, 7, 3},	//Descriptor for 'Р¤' (212)
    {765, 7, 7, 3},	//Descriptor for 'РҐ' (213)
    {772, 7, 9, 1},	//Descriptor for 'Р¦' (214)
    {781, 7, 7, 3},	//Descriptor for 'Р§' (215)
    {788, 7, 7, 3},	//Descriptor for 'РЁ' (216)
    {795, 7, 9, 1},	//Descriptor for 'Р©' (217)
    {804, 7, 7, 3},	//Descriptor for 'РЄ' (218)
    {811, 7, 7, 3},	//Descriptor for 'Р«' (219)
    {818, 6, 7, 3},	//Descriptor for 'Р¬' (220)
    {825, 5, 7, 3},	//Descriptor for 'Р­' (221)
    {832, 7, 7, 3},	//Descriptor for 'Р®' (222)
    {839, 6, 7, 3},	//Descriptor for 'РЇ' (223)
    {846, 6, 5, 3},	//Descriptor for 'Р°' (224)
    {851, 5, 8, 3},	//Descriptor for 'Р±' (225)
    {859, 5, 5, 3},	//Descriptor for 'РІ' (226)
    {864, 5, 5, 3},	//Descriptor for 'Рі' (227)
    {869, 6, 6, 2},	//Descriptor for 'Рґ' (228)
    {875, 5, 5, 3},	//Descriptor for 'Рµ' (229)
    {880, 7, 5, 3},	//Descriptor for 'Р¶' (230)
    {885, 5, 5, 3},	//Descriptor for 'Р·' (231)
    {890, 7, 5, 3},	//Descriptor for 'Рё' (232)
    {895, 7, 8, 3},	//Descriptor for 'Р№' (233)
    {903, 6, 5, 3},	//Descriptor for 'Рє' (234)
    {908, 7, 5, 3},	//Descriptor for 'Р»' (235)
    {913, 7, 5, 3},	//Descriptor for 'Рј' (236)
    {918, 7, 5, 3},	//Descriptor for 'РЅ' (237)
    {923, 5, 5, 3},	//Descriptor for 'Рѕ' (238)
    {928, 7, 5, 3},	//Descriptor for 'Рї' (239)
    {933, 6, 7, 1},	//Descriptor for 'СЂ' (240)
    {940, 5, 5, 3},	//Descriptor for 'СЃ' (241)
    {945, 5, 5, 3},	//Descriptor for 'С‚' (242)
    {950, 5, 7, 1},	//Descriptor for 'Сѓ' (243)
    {957, 5, 9, 1},	//Descriptor for 'С„' (244)
    {966, 5, 5, 3},	//Descriptor for 'С…' (245)
    {971, 7, 6, 2},	//Descriptor for 'С†' (246)
    {977, 6, 5, 3},	//Descriptor for 'С‡' (247)
    {982, 7, 5, 3},	//Descriptor for 'С€' (248)
    {987, 7, 6, 2},	//Descriptor for 'С‰' (249)
    {993, 6, 5, 3},	//Descriptor for 'СЉ' (250)
    {998, 7, 5, 3},	//Descriptor for 'С‹' (251)
    {1003, 5, 5, 3},	//Descriptor for 'СЊ' (252)
    {1008, 5, 5, 3},	//Descriptor for 'СЌ' (253)
    {1013, 7, 5, 3},	//Descriptor for 'СЋ' (254)
    {1018, 6, 5, 3},	//Descriptor for 'СЏ' (255)
}; //Local 8-bit codepage table descriptors

Font_type_t font_Courier_New_8pt  =
{
    "Courier New 8pt", /*name*/
    Courier_New_8pt_Bitmaps, /*bitmaps*/
    Courier_New_8pt_Descriptors, /*descr*/
    0, /*width*/
    13, /*height*/
    32, /*start*/
    255, /*stop*/
    1, /*spacing*/
};
